{
  "title": "Extremist Leader Commonality Quiz",
  "categories": [
    {
      "title": "early death of parents",
      "questions": [
        {
          "title": "did one or both of your parents die before the age of 16?",
          "alpha": 1
        }
      ]
    },
    {
      "title": "poor upbringing",
      "questions": [
        { "title": "did you have a less than fortunate childhood?", "alpha": 1 }
      ]
    },
    {
      "title": "Abused as a child",
      "questions": [
        { "title": "did you experience any abuse as a child?", "alpha": 1 },
        {
          "title": "have you experienced any abuse throughout adulthood",
          "alpha": 1
        }
      ]
    },
    {
      "title": "long held hate / grudges",
      "questions": [
        { "title": "do you hold grudges easily?", "alpha": 1 },
        {
          "title": "have you ever had long held hatred for a group of people?",
          "alpha": 1
        }
      ]
    },
    {
      "title": "served in military",
      "questions": [
        { "title": "have you or are you serving in the military?", "alpha": 1 },
        { "title": "do you plan on serving in the military?", "alpha": 1 }
      ]
    },
    {
      "title": "rebellious childhood",
      "questions": [
        { "title": "were you considered a rebellious child?", "alpha": 1 },
        { "title": "do you generally follow rules to the T?", "alpha": 1 }
      ]
    },
    {
      "title": "Obsessive",
      "questions": [
        {
          "title": "I frequently find myself fixated on a single goal or task for long periods.",
          "alpha": 1
        },
        {
          "title": "I often think about the same issue or project, even when I’m doing other things.",
          "alpha": 1
        },
        {
          "title": "I struggle to let go of plans or ideas, even when they may no longer be practical.",
          "alpha": 1
        },
        {
          "title": "I am highly detail-oriented and spend extra time perfecting my work.",
          "alpha": 1
        },
        {
          "title": "I feel uneasy or distracted when I can’t focus on my current objective.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "uncompromising",
      "questions": [
        {
          "title": "I rarely change my stance on issues, even when presented with opposing viewpoints.",
          "alpha": 1
        },
        {
          "title": "I prioritize sticking to my principles, even if it creates conflict with others.",
          "alpha": 1
        },
        {
          "title": "I believe that bending the rules weakens one's integrity.",
          "alpha": 1
        },
        {
          "title": "I expect others to meet my standards and find it difficult to tolerate mistakes.",
          "alpha": 1
        },
        {
          "title": "I feel that compromise often leads to unsatisfactory outcomes.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "secretive",
      "questions": [
        {
          "title": "I often keep personal information or plans to myself, even from close friends.",
          "alpha": 1
        },
        {
          "title": "I prefer to work alone to avoid others interfering with my decisions.",
          "alpha": 1
        },
        {
          "title": "I rarely share my thoughts or feelings, fearing they might be used against me.",
          "alpha": 1
        },
        {
          "title": "I carefully decide who I can trust before disclosing sensitive information.",
          "alpha": 1
        },
        {
          "title": "I believe that keeping certain things private gives me an advantage.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "resilient",
      "questions": [
        {
          "title": "I can recover quickly from setbacks or failures.",
          "alpha": 1
        },
        {
          "title": "I see challenges as opportunities to grow rather than obstacles.",
          "alpha": 1
        },
        {
          "title": "I remain determined to succeed, even when circumstances become overwhelming.",
          "alpha": 1
        },
        {
          "title": "I find it easy to maintain a positive outlook in difficult situations.",
          "alpha": 1
        },
        {
          "title": "I often look back at past struggles and feel proud of how I overcame them.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "cunning",
      "questions": [
        {
          "title": "I can think several steps ahead to anticipate others’ actions.",
          "alpha": 1
        },
        {
          "title": "I excel at finding unconventional solutions to problems.",
          "alpha": 1
        },
        {
          "title": "I often weigh how others can be useful to my goals.",
          "alpha": 1
        },
        {
          "title": "I sometimes withhold or distort information to maintain an advantage.",
          "alpha": 1
        },
        {
          "title": "I enjoy strategizing to outmaneuver competition or opposition.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "ambition",
      "questions": [
        {
          "title": "I set high goals for myself and work hard to achieve them.",
          "alpha": 1
        },
        {
          "title": "I constantly seek ways to improve my position in life.",
          "alpha": 1
        },
        {
          "title": "I measure success by how much progress I’ve made toward my aspirations.",
          "alpha": 1
        },
        {
          "title": "I believe that achieving great things requires sacrifices.",
          "alpha": 1
        },
        {
          "title": "I often imagine myself in positions of power or influence.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "ruthless",
      "questions": [
        {
          "title": "I am willing to do whatever it takes to achieve my goals, even at others’ expense.",
          "alpha": 1
        },
        {
          "title": "I believe that sentimentality often gets in the way of progress.",
          "alpha": 1
        },
        {
          "title": "I don’t hesitate to cut ties with people who no longer serve my objectives.",
          "alpha": 1
        },
        {
          "title": "I am comfortable making tough decisions that others may find harsh.",
          "alpha": 1
        },
        {
          "title": "I believe that success justifies the means used to achieve it.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "lonely",
      "questions": [
        {
          "title": "I often feel misunderstood, even by people close to me.",
          "alpha": 1
        },
        {
          "title": "I struggle to form deep emotional connections with others.",
          "alpha": 1
        },
        { "title": "I sometimes feel isolated, even in a crowd.", "alpha": 1 },
        {
          "title": "I feel that most people cannot relate to my experiences or mindset.",
          "alpha": 1
        },
        {
          "title": "I find myself longing for companionship, but I don’t know how to achieve it.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "charismatic",
      "questions": [
        {
          "title": "I am often the center of attention in social settings.",
          "alpha": 1
        },
        {
          "title": "People frequently come to me for advice or inspiration.",
          "alpha": 1
        },
        {
          "title": "I enjoy persuading others to see things from my perspective.",
          "alpha": 1
        },
        {
          "title": "I find it easy to connect with and influence others.",
          "alpha": 1
        },
        {
          "title": "I often inspire loyalty and enthusiasm among my peers.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "authoritarian",
      "questions": [
        {
          "title": "I prefer to be in charge rather than take direction from others.",
          "alpha": 1
        },
        {
          "title": "I believe that strict rules and discipline are necessary for success.",
          "alpha": 1
        },
        {
          "title": "I expect others to follow my instructions without question.",
          "alpha": 1
        },
        {
          "title": "I feel most comfortable when I have full control over a situation.",
          "alpha": 1
        },
        {
          "title": "I think hierarchy and authority are essential for order.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "manipulative",
      "questions": [
        {
          "title": "I can easily influence others to do what I want.",
          "alpha": 1
        },
        {
          "title": "I sometimes use others’ emotions to achieve my own goals.",
          "alpha": 1
        },
        {
          "title": "I often calculate how to phrase things to get the response I want.",
          "alpha": 1
        },
        {
          "title": "I believe that people are tools to be used for specific purposes.",
          "alpha": 1
        },
        {
          "title": "I am skilled at presenting myself in ways that benefit me.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "creative",
      "questions": [
        {
          "title": "I often come up with unique ideas or solutions to problems.",
          "alpha": 1
        },
        {
          "title": "I enjoy experimenting with new methods or techniques in my work.",
          "alpha": 1
        },
        {
          "title": "I see connections between concepts that others might overlook.",
          "alpha": 1
        },
        {
          "title": "I feel most fulfilled when I’m expressing myself creatively.",
          "alpha": 1
        },
        {
          "title": "I enjoy imagining new possibilities and turning them into reality.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "visionary",
      "questions": [
        {
          "title": "I often think about how the future could be different or better.",
          "alpha": 1
        },
        {
          "title": "I have a clear vision for how I want my life or projects to unfold.",
          "alpha": 1
        },
        {
          "title": "I enjoy planning long-term strategies to achieve my dreams.",
          "alpha": 1
        },
        {
          "title": "I believe I can inspire others with my ideas for a better world.",
          "alpha": 1
        },
        {
          "title": "I focus more on big-picture goals than on immediate concerns.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "narcissistic",
      "questions": [
        {
          "title": "I often feel that I deserve special treatment or recognition.",
          "alpha": 1
        },
        {
          "title": "I am confident that I am more capable than most people around me.",
          "alpha": 1
        },
        {
          "title": "I frequently seek admiration or praise for my accomplishments.",
          "alpha": 1
        },
        {
          "title": "I believe my ideas and opinions are usually correct.",
          "alpha": 1
        },
        {
          "title": "I focus on building a legacy that reflects my greatness.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "persistent",
      "questions": [
        {
          "title": "I rarely give up on something once I’ve committed to it.",
          "alpha": 1
        },
        {
          "title": "I believe that effort and determination can overcome almost any obstacle.",
          "alpha": 1
        },
        {
          "title": "I often keep working toward my goals, even when progress is slow.",
          "alpha": 1
        },
        {
          "title": "I pride myself on following through with my plans, no matter what.",
          "alpha": 1
        },
        {
          "title": "I refuse to let setbacks deter me from achieving success.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "paranoid",
      "questions": [
        {
          "title": "I am often suspicious of others’ motives, even without clear evidence.",
          "alpha": 1
        },
        {
          "title": "I believe that people might be plotting against me or undermining me.",
          "alpha": 1
        },
        {
          "title": "I frequently feel the need to protect myself from potential threats.",
          "alpha": 1
        },
        {
          "title": "I am wary of trusting others, even those who seem friendly.",
          "alpha": 1
        },
        {
          "title": "I find it difficult to shake the feeling that something bad is about to happen.",
          "alpha": 1
        }
      ]
    },
    {
      "title": "concerned with self image",
      "questions": [
        { "title": "I am concerned with what people think me", "alpha": 1 },
        { "title": "I put self worth in my relationships", "alpha": 1 },
        { "title": "I don't like when people don't like me", "alpha": 1 }
      ]
    },
    {
      "title": "willing to be a martyr",
      "questions": [
        {
          "title": "I would put my life on the line for something I believe in",
          "alpha": 1
        },
        {
          "title": "I would be willing to give my life for a cause I am passionate about",
          "alpha": 1
        },
        {
          "title": "I would be willing to make sacrifices for my ideology",
          "alpha": 1
        }
      ]
    }
  ]
}
